MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKL82Z128VMP7/mcu.h
/*! @name BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled) */
/*! @{ */
#define DMA_BITER_ELINKYES_BITER_MASK            (0x1FFU)
#define DMA_BITER_ELINKYES_BITER_SHIFT           (0U)
#define DMA_BITER_ELINKYES_BITER(x)              (((uint16_t)(((uint16_t)(x)) << DMA_BITER_ELINKYES_BITER_SHIFT)) & DMA_BITER_ELINKYES_BITER_MASK)
#define DMA_BITER_ELINKYES_LINKCH_MASK           (0xE00U)
#define DMA_BITER_ELINKYES_LINKCH_SHIFT          (9U)
#define DMA_BITER_ELINKYES_LINKCH(x)             (((uint16_t)(((uint16_t)(x)) << DMA_BITER_ELINKYES_LINKCH_SHIFT)) & DMA_BITER_ELINKYES_LINKCH_MASK)
#define DMA_BITER_ELINKYES_ELINK_MASK            (0x8000U)
#define DMA_BITER_ELINKYES_ELINK_SHIFT           (15U)
/*! ELINK - Enables channel-to-channel linking on minor loop complete
 *  0b0..The channel-to-channel linking is disabled
 *  0b1..The channel-to-channel linking is enabled
 */
#define DMA_BITER_ELINKYES_ELINK(x)              (((uint16_t)(((uint16_t)(x)) << DMA_BITER_ELINKYES_ELINK_SHIFT)) & DMA_BITER_ELINKYES_ELINK_MASK)
/*! @} */

/* The count of DMA_BITER_ELINKYES */
#define DMA_BITER_ELINKYES_COUNT                 (8U)


/*!
 * @}
 */ /* end of group DMA_Register_Masks */


/* DMA - Peripheral instance base addresses */
/** Peripheral DMA base address */
#define DMA_BASE                                 (0x40008000u)
/** Peripheral DMA base pointer */
#define DMA0                                     ((DMA_Type *)DMA_BASE)
/** Array initializer of DMA peripheral base addresses */
#define DMA_BASE_ADDRS                           { DMA_BASE }
/** Array initializer of DMA peripheral base pointers */
#define DMA_BASE_PTRS                            { DMA0 }
/** Interrupt vectors for the DMA peripheral type */
#define DMA_CHN_IRQS                             { { DMA0_DMA4_IRQn, DMA1_DMA5_IRQn, DMA2_DMA6_IRQn, DMA3_DMA7_IRQn, DMA0_DMA4_IRQn, DMA1_DMA5_IRQn, DMA2_DMA6_IRQn, DMA3_DMA7_IRQn } }
#define DMA_ERROR_IRQS                           { DMA_Error_IRQn }

/*!
 * @}
 */ /* end of group DMA_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- DMAMUX Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMAMUX_Peripheral_Access_Layer DMAMUX Peripheral Access Layer
 * @{
 */

/** DMAMUX - Register Layout Typedef */
typedef struct {
  __IO uint8_t CHCFG[8];                           /**< Channel Configuration register, array offset: 0x0, array step: 0x1 */
} DMAMUX_Type;

/* ----------------------------------------------------------------------------
   -- DMAMUX Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMAMUX_Register_Masks DMAMUX Register Masks
 * @{
 */

/*! @name CHCFG - Channel Configuration register */
/*! @{ */
#define DMAMUX_CHCFG_SOURCE_MASK                 (0x3FU)
#define DMAMUX_CHCFG_SOURCE_SHIFT                (0U)
/*! SOURCE - DMA Channel Source (Slot)
 *  0b000000..Disable_Signal
 *  0b000001..FlexIO0_Channel0_Signal
 *  0b000010..FlexIO0_Channel1_Signal
 *  0b000011..FlexIO0_Channel2_Signal
 *  0b000100..FlexIO0_Channel3_Signal
 *  0b000101..FlexIO0_Channel4_Signal
 *  0b000110..FlexIO0_Channel5_Signal
 *  0b000111..FlexIO0_Channel6_Signal
 *  0b001000..FlexIO0_Channel7_Signal
 *  0b001001..I2C0_Signal
 *  0b001010..I2C1_Signal
 *  0b001111..LPUART0_Rx_Signal
 *  0b010000..LPUART0_Tx_Signal
 *  0b010001..LPUART1_Rx_Signal
 *  0b010010..LPUART1_Tx_Signal
 *  0b010011..LPUART2_Rx_Signal
 *  0b010100..LPUART2_Tx_Signal
 *  0b010101..SPI0_Rx_Signal
 *  0b010110..SPI0_Tx_Signal
 *  0b010111..SPI1_Rx_Signal
 *  0b011000..SPI1_Tx_Signal
 *  0b011001..QSPI0_Rx_Signal
 *  0b011010..QSPI0_Tx_Signal
 *  0b011011..TPM0_Channel0_Signal
 *  0b011100..TPM0_Channel1_Signal
 *  0b011101..TPM0_Channel2_Signal
 *  0b011110..TPM0_Channel3_Signal
 *  0b011111..TPM0_Channel4_Signal
 *  0b100000..TPM0_Channel5_Signal
 *  0b100011..TPM0_Overflow_Signal
 *  0b100100..TPM1_Channel0_Signal
 *  0b100101..TPM1_Channel1_Signal
 *  0b100110..TPM1_Overflow_Signal
 *  0b100111..TPM2_Channel0_Signal
 *  0b101000..TPM2_Channel1_Signal
 *  0b101001..TPM2_Overflow_Signal
 *  0b101010..TSI0_Signal
 *  0b101011..EMVSIM0_Rx_Signal
 *  0b101100..EMVSIM0_Tx_Signal
 *  0b101101..EMVSIM1_Rx_Signal
 *  0b101110..EMVSIM1_Tx_Signal
 *  0b101111..PortA_Signal
 *  0b110000..PortB_Signal
 *  0b110001..PortC_Signal
 *  0b110010..PortD_Signal
 *  0b110011..PortE_Signal
 *  0b110100..ADC0_Signal
 *  0b110110..DAC0_Signal
 *  0b110111..LTC0_PKHA_Signal
 *  0b111000..CMP0_Signal
 *  0b111010..LTC0_Input_FIFO_Signal
 *  0b111011..LTC0_Output_FIFO_Signal
 *  0b111100..AlwaysOn60_Signal
 *  0b111101..AlwaysOn61_Signal
 *  0b111110..AlwaysOn62_Signal
 *  0b111111..AlwaysOn63_Signal
 */
#define DMAMUX_CHCFG_SOURCE(x)                   (((uint8_t)(((uint8_t)(x)) << DMAMUX_CHCFG_SOURCE_SHIFT)) & DMAMUX_CHCFG_SOURCE_MASK)
#define DMAMUX_CHCFG_TRIG_MASK                   (0x40U)
#define DMAMUX_CHCFG_TRIG_SHIFT                  (6U)
/*! TRIG - DMA Channel Trigger Enable
 *  0b0..Triggering is disabled. If triggering is disabled and ENBL is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
 *  0b1..Triggering is enabled. If triggering is enabled and ENBL is set, the DMAMUX is in Periodic Trigger mode.
 */
#define DMAMUX_CHCFG_TRIG(x)                     (((uint8_t)(((uint8_t)(x)) << DMAMUX_CHCFG_TRIG_SHIFT)) & DMAMUX_CHCFG_TRIG_MASK)
#define DMAMUX_CHCFG_ENBL_MASK                   (0x80U)
#define DMAMUX_CHCFG_ENBL_SHIFT                  (7U)
/*! ENBL - DMA Channel Enable
 *  0b0..DMA channel is disabled. This mode is primarily used during configuration of the DMAMux. The DMA has separate channel enables/disables, which should be used to disable or reconfigure a DMA channel.
 *  0b1..DMA channel is enabled
 */
#define DMAMUX_CHCFG_ENBL(x)                     (((uint8_t)(((uint8_t)(x)) << DMAMUX_CHCFG_ENBL_SHIFT)) & DMAMUX_CHCFG_ENBL_MASK)
/*! @} */

