MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKL82Z128VMP7/mcu.h
/*! @name OFIFO - LTC Output Data FIFO */
/*! @{ */
#define LTC_OFIFO_OFIFO_MASK                     (0xFFFFFFFFU)
#define LTC_OFIFO_OFIFO_SHIFT                    (0U)
#define LTC_OFIFO_OFIFO(x)                       (((uint32_t)(((uint32_t)(x)) << LTC_OFIFO_OFIFO_SHIFT)) & LTC_OFIFO_OFIFO_MASK)
/*! @} */

/* The count of LTC_PKA */
#define LTC_PKA_COUNT                            (64U)

/*! @name PKA0 - LTC PKHA A0 0 Register..LTC PKHA A0 15 Register */
/*! @{ */
#define LTC_PKA0_PKHA_A0_MASK                    (0xFFFFFFFFU)
#define LTC_PKA0_PKHA_A0_SHIFT                   (0U)
#define LTC_PKA0_PKHA_A0(x)                      (((uint32_t)(((uint32_t)(x)) << LTC_PKA0_PKHA_A0_SHIFT)) & LTC_PKA0_PKHA_A0_MASK)
/*! @} */

/* The count of LTC_PKA0 */
#define LTC_PKA0_COUNT                           (16U)

/*! @name PKA1 - LTC PKHA A1 0 Register..LTC PKHA A1 15 Register */
/*! @{ */
#define LTC_PKA1_PKHA_A1_MASK                    (0xFFFFFFFFU)
#define LTC_PKA1_PKHA_A1_SHIFT                   (0U)
#define LTC_PKA1_PKHA_A1(x)                      (((uint32_t)(((uint32_t)(x)) << LTC_PKA1_PKHA_A1_SHIFT)) & LTC_PKA1_PKHA_A1_MASK)
/*! @} */

/* The count of LTC_PKA1 */
#define LTC_PKA1_COUNT                           (16U)

/*! @name PKA2 - LTC PKHA A2 0 Register..LTC PKHA A2 15 Register */
/*! @{ */
#define LTC_PKA2_PKHA_A2_MASK                    (0xFFFFFFFFU)
#define LTC_PKA2_PKHA_A2_SHIFT                   (0U)
#define LTC_PKA2_PKHA_A2(x)                      (((uint32_t)(((uint32_t)(x)) << LTC_PKA2_PKHA_A2_SHIFT)) & LTC_PKA2_PKHA_A2_MASK)
/*! @} */

/* The count of LTC_PKA2 */
#define LTC_PKA2_COUNT                           (16U)

/*! @name PKA3 - LTC PKHA A3 0 Register..LTC PKHA A3 15 Register */
/*! @{ */
#define LTC_PKA3_PKHA_A3_MASK                    (0xFFFFFFFFU)
#define LTC_PKA3_PKHA_A3_SHIFT                   (0U)
#define LTC_PKA3_PKHA_A3(x)                      (((uint32_t)(((uint32_t)(x)) << LTC_PKA3_PKHA_A3_SHIFT)) & LTC_PKA3_PKHA_A3_MASK)
/*! @} */

/* The count of LTC_PKA3 */
#define LTC_PKA3_COUNT                           (16U)

/* The count of LTC_PKB */
#define LTC_PKB_COUNT                            (64U)

/*! @name PKB0 - LTC PKHA B0 0 Register..LTC PKHA B0 15 Register */
/*! @{ */
#define LTC_PKB0_PKHA_B0_MASK                    (0xFFFFFFFFU)
#define LTC_PKB0_PKHA_B0_SHIFT                   (0U)
#define LTC_PKB0_PKHA_B0(x)                      (((uint32_t)(((uint32_t)(x)) << LTC_PKB0_PKHA_B0_SHIFT)) & LTC_PKB0_PKHA_B0_MASK)
/*! @} */

/* The count of LTC_PKB0 */
#define LTC_PKB0_COUNT                           (16U)

/*! @name PKB1 - LTC PKHA B1 0 Register..LTC PKHA B1 15 Register */
/*! @{ */
#define LTC_PKB1_PKHA_B1_MASK                    (0xFFFFFFFFU)
#define LTC_PKB1_PKHA_B1_SHIFT                   (0U)
#define LTC_PKB1_PKHA_B1(x)                      (((uint32_t)(((uint32_t)(x)) << LTC_PKB1_PKHA_B1_SHIFT)) & LTC_PKB1_PKHA_B1_MASK)
/*! @} */

/* The count of LTC_PKB1 */
#define LTC_PKB1_COUNT                           (16U)

/*! @name PKB2 - LTC PKHA B2 0 Register..LTC PKHA B2 15 Register */
/*! @{ */
#define LTC_PKB2_PKHA_B2_MASK                    (0xFFFFFFFFU)
#define LTC_PKB2_PKHA_B2_SHIFT                   (0U)
#define LTC_PKB2_PKHA_B2(x)                      (((uint32_t)(((uint32_t)(x)) << LTC_PKB2_PKHA_B2_SHIFT)) & LTC_PKB2_PKHA_B2_MASK)
/*! @} */

/* The count of LTC_PKB2 */
#define LTC_PKB2_COUNT                           (16U)

/*! @name PKB3 - LTC PKHA B3 0 Register..LTC PKHA B3 15 Register */
/*! @{ */
#define LTC_PKB3_PKHA_B3_MASK                    (0xFFFFFFFFU)
#define LTC_PKB3_PKHA_B3_SHIFT                   (0U)
#define LTC_PKB3_PKHA_B3(x)                      (((uint32_t)(((uint32_t)(x)) << LTC_PKB3_PKHA_B3_SHIFT)) & LTC_PKB3_PKHA_B3_MASK)
/*! @} */

/* The count of LTC_PKB3 */
#define LTC_PKB3_COUNT                           (16U)

/* The count of LTC_PKN */
#define LTC_PKN_COUNT                            (64U)

/*! @name PKN0 - LTC PKHA N0 0 Register..LTC PKHA N0 15 Register */
/*! @{ */
#define LTC_PKN0_PKHA_N0_MASK                    (0xFFFFFFFFU)
#define LTC_PKN0_PKHA_N0_SHIFT                   (0U)
#define LTC_PKN0_PKHA_N0(x)                      (((uint32_t)(((uint32_t)(x)) << LTC_PKN0_PKHA_N0_SHIFT)) & LTC_PKN0_PKHA_N0_MASK)
/*! @} */

/* The count of LTC_PKN0 */
#define LTC_PKN0_COUNT                           (16U)

/*! @name PKN1 - LTC PKHA N1 0 Register..LTC PKHA N1 15 Register */
/*! @{ */
#define LTC_PKN1_PKHA_N1_MASK                    (0xFFFFFFFFU)
#define LTC_PKN1_PKHA_N1_SHIFT                   (0U)
#define LTC_PKN1_PKHA_N1(x)                      (((uint32_t)(((uint32_t)(x)) << LTC_PKN1_PKHA_N1_SHIFT)) & LTC_PKN1_PKHA_N1_MASK)
/*! @} */

/* The count of LTC_PKN1 */
#define LTC_PKN1_COUNT                           (16U)

/*! @name PKN2 - LTC PKHA N2 0 Register..LTC PKHA N2 15 Register */
/*! @{ */
#define LTC_PKN2_PKHA_N2_MASK                    (0xFFFFFFFFU)
#define LTC_PKN2_PKHA_N2_SHIFT                   (0U)
#define LTC_PKN2_PKHA_N2(x)                      (((uint32_t)(((uint32_t)(x)) << LTC_PKN2_PKHA_N2_SHIFT)) & LTC_PKN2_PKHA_N2_MASK)
/*! @} */

/* The count of LTC_PKN2 */
#define LTC_PKN2_COUNT                           (16U)

/*! @name PKN3 - LTC PKHA N3 0 Register..LTC PKHA N3 15 Register */
/*! @{ */
#define LTC_PKN3_PKHA_N3_MASK                    (0xFFFFFFFFU)
#define LTC_PKN3_PKHA_N3_SHIFT                   (0U)
#define LTC_PKN3_PKHA_N3(x)                      (((uint32_t)(((uint32_t)(x)) << LTC_PKN3_PKHA_N3_SHIFT)) & LTC_PKN3_PKHA_N3_MASK)
/*! @} */

/* The count of LTC_PKN3 */
#define LTC_PKN3_COUNT                           (16U)

/* The count of LTC_PKE */
#define LTC_PKE_COUNT                            (64U)

/*! @name PKE0 - LTC PKHA E0 0 Register..LTC PKHA E0 15 Register */
/*! @{ */
#define LTC_PKE0_PKHA_E0_MASK                    (0xFFFFFFFFU)
#define LTC_PKE0_PKHA_E0_SHIFT                   (0U)
#define LTC_PKE0_PKHA_E0(x)                      (((uint32_t)(((uint32_t)(x)) << LTC_PKE0_PKHA_E0_SHIFT)) & LTC_PKE0_PKHA_E0_MASK)
/*! @} */

/* The count of LTC_PKE0 */
#define LTC_PKE0_COUNT                           (16U)

/*! @name PKE1 - LTC PKHA E1 0 Register..LTC PKHA E1 15 Register */
/*! @{ */
#define LTC_PKE1_PKHA_E1_MASK                    (0xFFFFFFFFU)
#define LTC_PKE1_PKHA_E1_SHIFT                   (0U)
#define LTC_PKE1_PKHA_E1(x)                      (((uint32_t)(((uint32_t)(x)) << LTC_PKE1_PKHA_E1_SHIFT)) & LTC_PKE1_PKHA_E1_MASK)
/*! @} */

/* The count of LTC_PKE1 */
#define LTC_PKE1_COUNT                           (16U)

/*! @name PKE2 - LTC PKHA E2 0 Register..LTC PKHA E2 15 Register */
/*! @{ */
#define LTC_PKE2_PKHA_E2_MASK                    (0xFFFFFFFFU)
#define LTC_PKE2_PKHA_E2_SHIFT                   (0U)
#define LTC_PKE2_PKHA_E2(x)                      (((uint32_t)(((uint32_t)(x)) << LTC_PKE2_PKHA_E2_SHIFT)) & LTC_PKE2_PKHA_E2_MASK)
/*! @} */

